# პირობითი ოპერატორები
# a == b    ტოლია
# a < b     ნაკლებია
# a > b     მეტია
# a >= b    მეტია ან ტოლია
# a <= b    ნაკლებია ან ტოლია
# a != b    არ უდრის


# If
a = 33
b = 200
# ამოწმებს პირობაას
if b > a:
    print("b მეტია a")


if b > a:
    print("b მეტია a")
# elif შედის if ში ერთ არჩევანს წარმოადგენს if elif ორივე
elif a == b:
    print("a და b არის ტოლი")


if b > a:
    print("b მეტია a")
elif a == b:
    print("a და b არის ტოლი")
# თუ წინა ორმა პირობამ არ იმუშავა else ეშვება
else:
    print("a მეტია b")

# And
c = 500
# თუ არც ერთი პირობა არაა სწორი არ გაეშვება
if a > b and c > a:
    print("ორივე პირობა მართებულია")

# Or
# თუ ერთ-ერთი პირობა სწორია მაშინ გაეშვება
if a > b or c > a:
    print("ორივე პირობა მართებულია")
