# მემკვიდრეობითობა გვაძლევს საშუალებას განვსაზღვროთ კლასი რომელსაც მიეკუთვნება მეთოდები და პარამეტრები სხვა კლასიდან 
# შეგვიძლიე ერთ კლასს მეორე მივაკუთვნოთ და განუსაზღვროთ მეთოდები რომელსაც სხვა კლადიდან მიიღებს (ან პარამეტრები გადავცეთ)
# მშობელი თავის მეთოდებს მემკვიდრეობით აძლევს მშვილ კლასებს და შვილი კი იღებს პარამეტრებს და მეთოდებს

# მშობელი კლასი
# კლასის სახელად პერსონის შექმნა, პარამეტრებით 
class Person:
    def __init__(self, fname, lname):
        self.firstname = fname
        self,lastname = lname

    def printname(self):
        print(self.firstname, self.lastnme)

# პერსონის კლასის გამოყენება ობიექტის შესაქმნელად და პრინტნეიმის მეთოდის გამოსაძახებლად
x = Person("John", "Doe")
x.printname()


# შვილი კლასი
# სტუდენტის კლასის შექმნა, რომელიც იღებს პროპერტიებს და მეთოდებს პერსონის კლასიდან (შვილი მშობლისგან)
class Student(Person):
    pass


# ინიტის ფუნქცია ავტომატურად ეშვება იმ მომენტში როცა კლასით ობიექტი იქმნება
class Student2(Person):
    def __init__(self, fname, lname):
        pass
        





