
# ოპერატორები
# არითმეტიკული ოპერატორები
# მინიჭების ოპერატორები
# შედარების ოპერატორები
# ლოგიკური ოპერატორები

x = 4
y = 5
# არითმეტიკული ოპერატორები
# შეკრება
print(x + y)
# გამოკლება
print(x - y)
# გამრავლება
print(x * y)
# გაყოფა
print(x / y)
# მოდულის გაგება (ნაშთის გაგება)
print(x % y)

x = 4
y = 5
# მინიჭების ოპერატორები
x = 5
print(x)
x = x + 3
print(x)
x = x - 3
print(x)
x = x * 3
print(x)
x = x / 3
print(x)
x = x % 3
print(x)

x = 4
y = 5
# შედარების ოპერატორები
# ტოლია
print(x == y)
# არაა ტოლი
print(x != y)
# მეტია
print(x > y)
# ნაკლებია
print(x < y)
# მეტია ან ტოლია
print(x >= y)
# ნაკლებია ან ტოლია
print(x <= y)

x = 4
y = 5
# ლოგიკური ოპერატორები
# And
# თუ ორივე პირობა True მაშინ აბრუნებს True
print(x < 5 and x < 10)
# Or
# თუ ერთერთი პირობა  True მაშინ აბრუნებს True
print(x < 5 or x < 4)
# Not
# თუ ერთერთი პირობა  True მაშინ აბრუნებს false
print(not(x < 5 and x < 10))
